// задачка 1 (емае вот это я замахнулся я ж анскилл блин)
// Ход мыслей
// ну для начала попросим у чела ввести число
let = userNum = prompt('Введите число, предшествующие цифры которого вы хотите увидеть');
let = x = 0;
// теперь наверное надо написать формулу для скрипта по которой он будет давать мне число, с кратными всякими потом замучаюсь
while(x = userNum){x + 1}
alert(x)












// // задачка с факториалом
// let = userNum = prompt('Введите число, факториал которого хотите получить:');

// alert(userNum);